{
  "mention": "social democrats",
  "offset": 448,
  "length": 16,
  "context": "y 1860's.\" According to the ''Encyclopedia Britannica'' \"During the Spanish revolution of 1873, Pi y Margall attempted to establish a decentralized, or \"cantonalist,\" political system on Proudhonian lines.\"\n\nIn 1864 the International Workingmen's Association (sometimes called the \"First International\") united diverse revolutionary currents including French followers of Proudhon, Blanquists, Philadelphes, English trade unionists, socialists and social democrats. Due to its links to active workers' movements, the International became a significant organization. Karl Marx became a leading figure in the International and a member of its General Council. Proudhon's followers, the mutualists, opposed Marx's state socialism, advocating political abstentionism and small property holdings. Woodcock also reports that the American individualist anarchists Lysander Spooner and William B. Greene had been members of the First International",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q48767222",
  "nil": true,
  "id": 0
}
{
  "mention": "George I of Greece",
  "offset": 439,
  "length": 18,
  "context": "une, the execution and exile of many ''communards'' to penal colonies, favoured individualist political expression and acts.\n\nNumerous heads of state were assassinated between 1881 and 1914 by members of the anarchist movement, including Tsar Alexander II of Russia, President Sadi Carnot of France, Empress Elisabeth of Austria, King Umberto I of Italy, President William McKinley of the United States, King Carlos I of Portugal and King George I of Greece. McKinley's assassin Leon Czolgosz claimed to have been influenced by anarchist and feminist Emma Goldman.\n\nPropaganda of the deed was abandoned by the vast majority of the anarchist movement after World War I (1914–1918) and the 1917 October Revolution.\n\n===Russian Revolution and other uprisings of the 1910s===\n\nNestor Makhno with members of the anarchist Revolutionary Insurrectionary Army of Ukraine\nAnarchists participated alongside the Bolsheviks in both February ",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q17142",
  "nil": false,
  "id": 1
}
{
  "mention": "Oranienburg",
  "offset": 455,
  "length": 11,
  "context": " and Italy were active in the Resistance during World War II. In Germany the anarchist Erich Mühsam was arrested on charges unknown in the early morning hours of 28 February 1933, within a few hours after the Reichstag fire in Berlin. Joseph Goebbels, the Nazi propaganda minister, labelled him as one of \"those Jewish subversives.\" Over the next seventeen months, he would be imprisoned in the concentration camps at Sonnenburg, Brandenburg and finally, Oranienburg. On 2 February 1934, Mühsam was transferred to the concentration camp at Oranienburg when finally on the night of 9 July 1934, Mühsam was tortured and murdered by the guards, his battered corpse found hanging in a latrine the next morning.\n\n=== Spanish Revolution ===\n\nIn Spain, the national anarcho-syndicalist trade union Confederación Nacional del Trabajo initially refused to join a popular front electoral alliance, and abstenti",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q14808",
  "nil": false,
  "id": 2
}
{
  "mention": "Catalonia",
  "offset": 494,
  "length": 9,
  "context": "stern countries against Hitler. That, of course, failed and Stalin withdrew the support to the Republic. They even withdrew the Spanish gold reserves.\"  The events known as the Spanish Revolution was a workers' social revolution that began during the outbreak of the Spanish Civil War in 1936 and resulted in the widespread implementation of anarchist and more broadly libertarian socialist organizational principles throughout various portions of the country for two to three years, primarily Catalonia, Aragon, Andalusia, and parts of the Levante. Much of Spain's economy was put under worker control; in anarchist strongholds like Catalonia, the figure was as high as 75%, but lower in areas with heavy Communist Party of Spain influence, as the Soviet-allied party actively resisted attempts at collectivisation enactment. Factories were run through worker committees, agrarian areas became co",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q5705",
  "nil": false,
  "id": 3
}
{
  "mention": "agrarian",
  "offset": 406,
  "length": 8,
  "context": " to three years, primarily Catalonia, Aragon, Andalusia, and parts of the Levante. Much of Spain's economy was put under worker control; in anarchist strongholds like Catalonia, the figure was as high as 75%, but lower in areas with heavy Communist Party of Spain influence, as the Soviet-allied party actively resisted attempts at collectivisation enactment. Factories were run through worker committees, agrarian areas became collectivised and run as libertarian communes. Anarchist historian Sam Dolgoff estimated that about eight million people participated directly or at least indirectly in the Spanish Revolution, which he claimed \"came closer to realizing the ideal of the free stateless society on a vast scale than any other revolution in history.\" Spanish Communist Party-led troops suppressed the collectives and persecuted both Workers' Party of Marxist",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q11451",
  "nil": false,
  "id": 4
}