{
  "mention": "social democrats",
  "offset": 448,
  "length": 16,
  "context": "y 1860's.\" According to the ''Encyclopedia Britannica'' \"During the Spanish revolution of 1873, Pi y Margall attempted to establish a decentralized, or \"cantonalist,\" political system on Proudhonian lines.\"\n\nIn 1864 the International Workingmen's Association (sometimes called the \"First International\") united diverse revolutionary currents including French followers of Proudhon, Blanquists, Philadelphes, English trade unionists, socialists and social democrats. Due to its links to active workers' movements, the International became a significant organization. Karl Marx became a leading figure in the International and a member of its General Council. Proudhon's followers, the mutualists, opposed Marx's state socialism, advocating political abstentionism and small property holdings. Woodcock also reports that the American individualist anarchists Lysander Spooner and William B. Greene had been members of the First International",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q48767222",
  "nil": true,
  "id": 0
}
{
  "mention": "social ecology",
  "offset": 469,
  "length": 14,
  "context": " is a noted advocate of post-left anarchy.\nAnarchism continues to generate many philosophies and movements, at times eclectic, drawing upon various sources, and syncretic, combining disparate concepts to create new philosophical approaches.\n\nGreen anarchism (or eco-anarchism) is a school of thought within anarchism that emphasises environmental issues, with an important precedent in anarcho-naturism, and whose main contemporary currents are anarcho-primitivism and social ecology.\n\nAnarcha-feminism (also called anarchist feminism and anarcho-feminism) combines anarchism with feminism. It generally views patriarchy as a manifestation of involuntary coercive hierarchy that should be replaced by decentralised free association. Anarcha-feminists believe that the struggle against patriarchy is an essential part of class struggle, and the anarchist struggle against the state. In essence, the philosophy sees anarchist struggle as a necessary component of feminist",
  "wikipedia_page_id": "12",
  "wikidata_id": "Q56599065",
  "nil": true,
  "id": 1
}
{
  "mention": "Level I trauma center",
  "offset": 494,
  "length": 21,
  "context": "of the state's major tourist destinations.\n\nAn estimated 20 million tourists visit the state each year. Over 100,000 of these are from other countries, including from Canada, the United Kingdom, Germany and Japan. In 2006, 22.3 million tourists spent $8.3 billion providing an estimated 162,000 jobs in the state. Some of the most popular areas include the Rocket City of Huntsville, the beaches along the Gulf, and the state's capitol in Montgomery.\n\n===Healthcare===\nUAB Hospital is the only Level I trauma center in Alabama. UAB is the largest state government employer in Alabama, with a workforce of about 18,000.\n\n===Banking===\nRegions-Harbert Plaza, Regions Center, and Wells Fargo Tower in Birmingham's financial district.\n\nAlabama has the headquarters of Regions Financial Corporation, BBVA Compass, Superior Bancorp and the former Colonial Bancgroup. Birmingham-based Compass Banchshares was acquired by Spanish-base",
  "wikipedia_page_id": "303",
  "wikidata_id": "Q535772",
  "nil": true,
  "id": 2
}
{
  "mention": "state of nature",
  "offset": 494,
  "length": 15,
  "context": "\"community\" or \"partnership\" (''koinōnia''). The aim of the city is not just to avoid injustice or for economic stability, but rather to allow at least some citizens the possibility to live a good life, and to perform beautiful acts: \"The political partnership must be regarded, therefore, as being for the sake of noble actions, not for the sake of living together.\" This is distinguished from modern approaches, beginning with social contract theory, according to which individuals leave the state of nature because of \"fear of violent death\" or its \"inconveniences.\"\n\nExcerpt from a speech by the character 'Aristotle' in the book Protrepticus (Hutchinson and Johnson, 2015 p. 22)\n:''For we all agree that the most excellent man should rule, i.e., the supreme by nature, and that the law rules and alone is authoritative; but the law is a kind of intelligence, i.e. a discourse based on intelligence. And again, what standard do we have, what criterion of good things, that i",
  "wikipedia_page_id": "308",
  "wikidata_id": "Q92775698",
  "nil": true,
  "id": 3
}
{
  "mention": "selfishness",
  "offset": 443,
  "length": 11,
  "context": "\n\nGiving alms to the poor is often considered an altruistic action.\n'''Altruism''' or '''selflessness''' is the principle or practice of concern for the welfare of others. It is a traditional virtue in many cultures and a core aspect of various religious traditions and secular worldviews, though the concept of \"others\" toward whom concern should be directed can vary among cultures and religions. Altruism or selflessness is the opposite of selfishness. The word was coined by the French philosopher Auguste Comte in French, as ''altruisme'', for an antonym of egoism. He derived it from the Italian ''altrui'', which in turn was derived from Latin ''alteri'', meaning \"other people\" or \"somebody else\".\n\nAltruism in biological organisms can be defined as an individual performing an action which is at a cost to themselves (e.g., pleasure and quality of life, time, probability of survival or reproduction), but benefits, either",
  "wikipedia_page_id": "336",
  "wikidata_id": "Q36381317",
  "nil": true,
  "id": 4
}